---
kind: enumMember
id: F:Autodesk.Revit.DB.DisplacementPathStyle.Straight
enum: Autodesk.Revit.DB.DisplacementPathStyle
source: html/b37f1b44-79a1-01ac-e2e4-fe7ca20c8a58.htm
---
# Autodesk.Revit.DB.DisplacementPathStyle.Straight

A single straight line is used to represent each stage of the displacement.